# Basic pandas

In [1]:
from pandas import Series, DataFrame
import pandas as pd
import numpy as np

## Data Structures in Pandas
* Series
* DataFrame

### Series

In [3]:
obj = Series([4,7,-5,3]);obj

0    4
1    7
2   -5
3    3
dtype: int64

In [4]:
obj2 = Series([4,7,-5,3], index = ['d','b','a','c']);obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [7]:
print(obj2.index,obj2.values)

(Index([u'd', u'b', u'a', u'c'], dtype='object'), array([ 4,  7, -5,  3]))

* Compared with Numpy array, in Series, the connection between index and value will be kept while indexing and calculation.

In [9]:
obj2[['c','a','d']]

c    3
a   -5
d    4
dtype: int64

In [11]:
obj2[obj2 > 0]

d    4
b    7
c    3
dtype: int64

In [12]:
obj2*2

d     8
b    14
a   -10
c     6
dtype: int64

In [15]:
np.exp(obj2)

d      54.598150
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

* Series can be considered as an ordered dictionary.

In [16]:
'b' in obj2

True

In [18]:
'e' in obj2

False

* Create Series by dictionary

In [19]:
sdata = {'Ohio':35000, 'Texas':71000,'Oregon':16000,'Utah':5000}
obj3 = Series(sdata); obj3

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

* Using key to create a Series based on an existing dictionary

In [20]:
states = ['Calfornia', 'Ohio', 'Oregon', 'Texas']
obj4 = Series(sdata, index = states); obj4

Calfornia        NaN
Ohio         35000.0
Oregon       16000.0
Texas        71000.0
dtype: float64

* Detect Null (NA) values

In [21]:
pd.isnull(obj4)

Calfornia     True
Ohio         False
Oregon       False
Texas        False
dtype: bool

In [22]:
pd.notnull(obj4)

Calfornia    False
Ohio          True
Oregon        True
Texas         True
dtype: bool

In [24]:
obj4.isnull()

Calfornia     True
Ohio         False
Oregon       False
Texas        False
dtype: bool

#### the calculation in Series can match data by index!!!!!

In [25]:
obj3 + obj4

Calfornia         NaN
Ohio          70000.0
Oregon        32000.0
Texas        142000.0
Utah              NaN
dtype: float64

* the 'name' attribute of Series objective and index

In [27]:
obj4.name = 'population'
obj4.index.name = 'state' ; obj4

state
Calfornia        NaN
Ohio         35000.0
Oregon       16000.0
Texas        71000.0
Name: population, dtype: float64

* modify the index

In [29]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']; obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

### DataFrame

In [21]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
       'year': [2000, 2001, 2002, 2001, 2002],
       'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}
frame = DataFrame(data); frame

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002

In [22]:
DataFrame(data, columns = ['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

In [23]:
frame2 = DataFrame(data, columns = ['year', 'state', 'pop', 'debt'],
                  index = ['one', 'two', 'three', 'four', 'five']); frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [24]:
frame2.columns

Index([u'year', u'state', u'pop', u'debt'], dtype='object')

In [25]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [26]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
Name: year, dtype: int64

In [28]:
frame2.ix['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [29]:
frame2['debt'] = 16.5; frame2.debt

one      16.5
two      16.5
three    16.5
four     16.5
five     16.5
Name: debt, dtype: float64

In [30]:
frame2.debt = np.arange(5.);frame2['debt']

one      0.0
two      1.0
three    2.0
four     3.0
five     4.0
Name: debt, dtype: float64

In [31]:
val = Series([-1.2, -2.5, -1.7], index = ['two', 'four', 'five'])
frame2.debt = val; frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -2.5
five   2002  Nevada  2.9  -1.7

In [32]:
frame2['eastern'] = frame2.state == 'Ohio'; frame2

       year   state  pop  debt eastern
one    2000    Ohio  1.5   NaN    True
two    2001    Ohio  1.7  -1.2    True
three  2002    Ohio  3.6   NaN    True
four   2001  Nevada  2.4  -2.5   False
five   2002  Nevada  2.9  -1.7   False

In [33]:
del frame2['eastern']; frame2.columns

Index([u'year', u'state', u'pop', u'debt'], dtype='object')

#### return by indexing is just the view of raw data, the modification will be mapped to the original dataframe

In [35]:
frameCopy = frame2.copy()

In [37]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
      'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
frame3 = DataFrame(pop); frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

* Transpose

In [40]:
print(frame3.T); frame3.T.columns

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

Int64Index([2000, 2001, 2002], dtype='int64')

In [41]:
DataFrame(pop, index = [2001, 2002, 2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [48]:
pdata = {'Ohio': frame3['Ohio'][:-1],
        'Nevada': frame3['Nevada'][:2]}
DataFrame(pdata)

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7

* 'name' attributes of DataFrame

In [49]:
frame3.index.name = 'year'; frame3.columns.name = 'state'; frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [50]:
frame3.values

array([[ nan,  1.5],
       [ 2.4,  1.7],
       [ 2.9,  3.6]])

In [51]:
frame2.values

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, -1.2],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, -2.5],
       [2002, 'Nevada', 2.9, -1.7]], dtype=object)

### Indexing Object

In [53]:
obj = Series(range(3), index = ['a','b','c'])
index= obj.index
index

Index([u'a', u'b', u'c'], dtype='object')

In [54]:
index[1:]

Index([u'b', u'c'], dtype='object')

* index is immutable, that is the reason why index can be shares among multiple data frames

In [56]:
index = pd.Index(np.arange(3))
obj2 = Series([1.5, -2.5, 0], index = index)
obj2.index is index

True

In [58]:
'Ohio' in frame3.columns

True

In [59]:
2003 in frame3.index

False

#### Function and attributes of Index

Funtion | Description
-----------|----------------------
append | add another index object, return a new Index
diff | compute the different index
intersection | as name
union | as name
isin | return a boolean value
delete | delete value at i, return a new index
drop | delete value i, return a new index
insert | insert a value at i, return a new index
is_monotonic | return True when it's increasing
is_unique |return True when no duplicates
unique | compute unique value in index

## Basic Function

### Reindex
* reoder by reindex

In [60]:
obj = Series([4.5,7.2,-5.3,3.6], index = ['d','b','a','c']); obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [63]:
obj2 = obj.reindex(['a','b','c','d','e']);obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [64]:
obj.reindex(['a','b','c','d','e'], fill_value = 0)

a   -5.3
b    7.2
c    3.6
d    4.5
e    0.0
dtype: float64

In [65]:
obj3 = Series(['blue','purple','yellow'], index = [0,2,4])
obj3.reindex(range(6), method = 'ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

#### Selection in method

paramaters | description
-------------|-----------
ffill / pad  | forward impute
bfill / backfill | backward impute

* reindex can modify both rows and columns

In [2]:
frame = DataFrame(np.arange(9).reshape((3,3)), index = ['a','c','d'], 
                  columns = ['Ohio','Texas','California']); frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [3]:
frame2 = frame.reindex(['a','b','c','d']); frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [4]:
states = ['Texas','Utah', 'California']; frame.reindex(columns = states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [5]:
frame.reindex(index = ['a', 'b', 'c','d'], method = 'ffill', 
             columns = states)

   Texas  Utah  California
a      1   NaN           2
b      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [6]:
frame.ix[['a','b','c','d'], states]

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

#### Parameters in reindex

parameter  |  description
-------|-----------
index  | as name
method | impute method
fill_value | the alternative impute value of NaN
limit | maximum number of impute when imputing
level | matching index a s MultiIndex, or choosing a subset
copy | default True, if False, no copy when new one is equal to old one

### Drop items at specific axis

In [8]:
obj = Series(np.arange(5.), index = 
            ['a','b','c','d','e'])
new_obj = obj.drop('c'); new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [9]:
obj.drop(['d','c'])

a    0.0
b    1.0
e    4.0
dtype: float64

#### at DataFrame

In [2]:
data = DataFrame(np.arange(16).reshape((4,4)),index = 
                ['Ohio', 'Colorado', 'Utah', 'New York'],
                columns = ['one','two','three','four'])
data.drop(['Colorado','Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [3]:
data.drop(['two','four'],axis = 1)

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

### Index, extract and filter

In [5]:
obj = Series(np.arange(4.), index = ['a' ,'b','c','d'])
print(obj['b'], obj[1])

(1.0, 1.0)

In [6]:
print(obj[2:4], obj[['b','a','d']])

(c    2.0
d    3.0
dtype: float64, b    1.0
a    0.0
d    3.0
dtype: float64)

In [7]:
print(obj[[1,3]], obj[obj<2])

(b    1.0
d    3.0
dtype: float64, a    0.0
b    1.0
dtype: float64)

* indexing by using label is different from normal indexing, it's end inclusive

In [8]:
obj['b':'c']

b    1.0
c    2.0
dtype: float64

#### at DataFrame

In [10]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int64

In [12]:
data[['three','one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [13]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [14]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [15]:
data<5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [16]:
data[data<5] = 0; data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [17]:
data.ix['Colorado',['two','three']]

two      5
three    6
Name: Colorado, dtype: int64

In [18]:
data.ix[['Colorado','Utah'],[3,0,1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [19]:
data.ix[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int64

In [20]:
data.ix[:'Utah','two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int64

In [21]:
data.ix[data.three > 5, :3]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

#### the setting in DataFrame Indexing

type | description
------------|-----------------
obj[val] | return columns
obj.ix[val] | return rows
obj[:, val] | return columns
obj[val1, val2] | extract row and column
reindex | 
xs | return a Series
icol, irow | return a Series
get_value, set_value | return value

### Calculation

In [22]:
s1 = Series([7.3,-2.5,3.4,1.5], index = ['a','c','d','e'])
s2 = Series([-2.1,3.6,-1.5,4,3.1], index = ['a','c','e','f','g'])
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [23]:
df1 = DataFrame(np.arange(9.).reshape((3,3)), columns = list('bcd'),
               index = ['Ohio','Texas','Colorado'])
df2 = DataFrame(np.arange(12.).reshape((4,3)), columns = list('bde'),
               index = ['Utah', 'Ohio', 'Texas', 'oregon'])
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN
oregon    NaN NaN   NaN NaN

#### impute values in calculation

In [25]:
df1 = DataFrame(np.arange(12.).reshape((3,4)), columns = list('abcd'))
df2 = DataFrame(np.arange(20.).reshape((4,5)), columns = list('abcde'))
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [26]:
df1.add(df2, fill_value = 0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [28]:
df2.add(df1, fill_value = 0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [29]:
df1.reindex(columns = df2.columns, fill_value = 0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

* more flexible calculation

function | description
------|------
add | +
sub | -
div | /
mul | *

#### calculation between DataFrame and Series

* broadcasting

In [34]:
arr = np.arange(12.).reshape((3,4))
print(type(arr))
arr - arr[0]

<type 'numpy.ndarray'>

array([[ 0.,  0.,  0.,  0.],
       [ 4.,  4.,  4.,  4.],
       [ 8.,  8.,  8.,  8.]])

In [35]:
frame = DataFrame(np.arange(12.).reshape((4,3)), columns = list('bde'),
                 index = ['Utah', 'Ohio', 'Texas','Oregon'])
series = frame.ix[0]

In [36]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [39]:
series = Series(range(3), index = ['b','e', 'f'])
frame + series

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [42]:
series3 = frame['d']
frame.sub(series3, axis = 0)

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

### Function Application and Mapping

* ufuncs in NumPy can be used.

In [2]:
frame = DataFrame(np.random.randn(4,3), columns = list('bde'),
                 index = ['Utah', 'Ohio', 'Texas','Oregon'])
frame

               b         d         e
Utah   -0.606862 -0.164112  2.157051
Ohio   -0.347990 -0.382038 -0.153863
Texas  -0.879425 -0.872810  1.464924
Oregon -0.335820  0.688588  0.295171

In [3]:
np.abs(frame)

               b         d         e
Utah    0.606862  0.164112  2.157051
Ohio    0.347990  0.382038  0.153863
Texas   0.879425  0.872810  1.464924
Oregon  0.335820  0.688588  0.295171

In [4]:
f = lambda x: x.max() - x.min()
frame.apply(f)

b    0.543605
d    1.561399
e    2.310914
dtype: float64

In [5]:
frame.apply(f,axis = 1)

Utah      2.763913
Ohio      0.228175
Texas     2.344349
Oregon    1.024408
dtype: float64

In [6]:
def f(x):
    return Series([x.min(), x.max()], index = ['min','max'])
frame.apply(f)

            b         d         e
min -0.879425 -0.872810 -0.153863
max -0.335820  0.688588  2.157051

In [7]:
format = lambda x: '%.2f' % x
frame.applymap(format)

            b      d      e
Utah    -0.61  -0.16   2.16
Ohio    -0.35  -0.38  -0.15
Texas   -0.88  -0.87   1.46
Oregon  -0.34   0.69   0.30

In [8]:
frame['e'].map(format)

Utah       2.16
Ohio      -0.15
Texas      1.46
Oregon     0.30
Name: e, dtype: object

* map() is used at item level in Series

### Ordering, Sorting and Ranking

In [10]:
obj = Series(range(4), index = list('dabc'))
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [22]:
frame = DataFrame(np.arange(8).reshape((2,4)), index = ['three', 'one'],
                 columns = list('dabc'))
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [23]:
frame.sort_index(axis = 1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [14]:
frame.sort_index(axis = 1, ascending = False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [24]:
obj = Series([4,7,-3,2])
obj.order()

/home/creatrol/anaconda2/lib/python2.7/site-packages/ipykernel/__main__.py:2: FutureWarning: order is deprecated, use sort_values(...)
  from ipykernel import kernelapp as app

2   -3
3    2
0    4
1    7
dtype: int64

In [25]:
obj = Series([4,7,np.nan,-3,np.nan,2])
obj.order()

/home/creatrol/anaconda2/lib/python2.7/site-packages/ipykernel/__main__.py:2: FutureWarning: order is deprecated, use sort_values(...)
  from ipykernel import kernelapp as app

3   -3.0
5    2.0
0    4.0
1    7.0
2    NaN
4    NaN
dtype: float64

In [26]:
frame = DataFrame({'b': [4,7,-3,2], "a":[0,1,0,1]})
frame.sort_index(by='b')

/home/creatrol/anaconda2/lib/python2.7/site-packages/ipykernel/__main__.py:2: FutureWarning: by argument to sort_index is deprecated, pls use .sort_values(by=...)
  from ipykernel import kernelapp as app

   a  b
2  0 -3
3  1  2
0  0  4
1  1  7

In [27]:
frame.sort_index(by=['a','b'])

/home/creatrol/anaconda2/lib/python2.7/site-packages/ipykernel/__main__.py:1: FutureWarning: by argument to sort_index is deprecated, pls use .sort_values(by=...)
  if __name__ == '__main__':

   a  b
2  0 -3
0  0  4
3  1  2
1  1  7

* rank gives a ranking number

In [28]:
obj = Series([7,-5,7,4,2,0,4])
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [29]:
obj.rank(method = 'first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [32]:
obj.rank(ascending = False, method = 'max')

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [33]:
frame = DataFrame({ 'b': [4.3,7,-3,2], 'a': [0,1,0,1],
                  'c': [-2,5,8,-2.5]})
frame.rank(axis = 1)

     a    b    c
0  2.0  3.0  1.0
1  1.0  3.0  2.0
2  2.0  1.0  3.0
3  2.0  3.0  1.0

#### ranking method

method | description
--------|------
'average' | default, average ranking for each value
'min' | minimum ranking number
'max' | maximum ranking number
'first' | follow the sequence of happening

### axis indexing with duplicated

In [34]:
obj = Series(range(5), index = list('aabbc'))
obj.index.is_unique

False

In [35]:
obj['a']

a    0
a    1
dtype: int64

In [37]:
df = DataFrame(np.random.randn(4,3), index = list('aabb'))
df.ix['b']

          0         1         2
b  1.050528  1.866519 -1.567370
b -1.479886  0.849785 -0.795009

## Summary & Statistical Description

In [4]:
df = DataFrame([[1.4, np.nan],[7.1,-4.5],
               [np.nan,np.nan],[0.75, -1.3]],
              index = list('abcd'),
              columns = 'one two'.split(' '))
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [5]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [6]:
df.sum(axis = 1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [7]:
df.mean(axis = 1, skipna = False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

* Settings

setting | description
--------|--------
axis | row = 0 , column = 1
skipna | default = True
level | for MultiIndex

* some indirect statistic

In [8]:
df.idxmax()

one    b
two    d
dtype: object

In [15]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [16]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [19]:
obj = Series(['a','a','b','c']*4)
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

#### Functions

function | description
-------|-------
count | count non-NA values
describe | statistical summary
min,max | as name
argmin, argmax | return indexing location (int)
idxmin, idxmax | return indexing value
quantile | calculate quantile values (0-1)
sum | as name
mean | as name
median | as name
mad | average absolute distance
var | variance
std | standard deviation
skew | skewness ( third order)
kurt | kurtosis ( forth order)
cumsum | cumulative sum
cummin, cummax | cumulative min, max
cumprod | cumulative product
diff | first-order difference (useful in time series)
pct_change | calculate the change of percentage

In [24]:
np.array(df)

array([[ 1.4 ,   nan],
       [ 7.1 , -4.5 ],
       [  nan,   nan],
       [ 0.75, -1.3 ]])

### Correlation coefficient and Covariance

In [2]:
import pandas.io.data as web
all_data = {}
for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']:
    all_data[ticker] = web.get_data_yahoo(ticker, '1/1/2000', '1/1/2010')
    
price = DataFrame({tic: data['Adj Close']
                  for tic, data in all_data.iteritems()})
volume = DataFrame({tic: data['Volume']
                  for tic, data in all_data.iteritems()})

/home/creatrol/anaconda2/lib/python2.7/site-packages/pandas/io/data.py:35: FutureWarning:
The pandas.io.data module is moved to a separate package (pandas-datareader) and will be removed from pandas in a future version.
After installing the pandas-datareader package (https://github.com/pydata/pandas-datareader), you can change the import ``from pandas.io import data, wb`` to ``from pandas_datareader import data, wb``.
  FutureWarning)

In [4]:
returns = price.pct_change()
returns.tail()

                AAPL      GOOG       IBM      MSFT
Date
2009-12-24  0.034339  0.011117  0.004385  0.002587
2009-12-28  0.012294  0.007098  0.013326  0.005484
2009-12-29 -0.011861 -0.005571 -0.003477  0.007058
2009-12-30  0.012147  0.005376  0.005461 -0.013699
2009-12-31 -0.004300 -0.004416 -0.012597 -0.015504

In [7]:
returns.head(2)

               AAPL  GOOG       IBM     MSFT
Date
2000-01-03      NaN   NaN       NaN      NaN
2000-01-04 -0.08431   NaN -0.033944 -0.03378

In [8]:
returns.MSFT.corr(returns.IBM)

0.49597967972033769

In [9]:
returns.MSFT.cov(returns.IBM)

0.00021595764064430057

In [10]:
returns.corr()

          AAPL      GOOG       IBM      MSFT
AAPL  1.000000  0.470676  0.410011  0.424305
GOOG  0.470676  1.000000  0.390689  0.443587
IBM   0.410011  0.390689  1.000000  0.495980
MSFT  0.424305  0.443587  0.495980  1.000000

In [11]:
returns.cov()

          AAPL      GOOG       IBM      MSFT
AAPL  0.001027  0.000303  0.000252  0.000309
GOOG  0.000303  0.000580  0.000142  0.000205
IBM   0.000252  0.000142  0.000367  0.000216
MSFT  0.000309  0.000205  0.000216  0.000516

In [13]:
returns.corrwith(returns.IBM)

AAPL    0.410011
GOOG    0.390689
IBM     1.000000
MSFT    0.495980
dtype: float64

In [19]:
returns.corrwith(volume)

AAPL   -0.057549
GOOG    0.062647
IBM    -0.007892
MSFT   -0.014245
dtype: float64

* calculate the correlation of matching index columns

### Unique value, count of value and isin

In [4]:
obj = Series(list('cacaaaccddb'))
obj.unique()

array(['c', 'a', 'd', 'b'], dtype=object)

In [6]:
obj.value_counts()

c    4
a    4
d    2
b    1
dtype: int64

In [7]:
pd.value_counts(obj.values, sort = False)

a    4
c    4
b    1
d    2
dtype: int64

In [8]:
mask = obj.isin(['b','c']); mask

0      True
1     False
2      True
3     False
4     False
5     False
6      True
7      True
8     False
9     False
10     True
dtype: bool

In [9]:
obj[mask]

0     c
2     c
6     c
7     c
10    b
dtype: object

In [10]:
data = DataFrame({'Q1': [1,3,4,3,4],
                 'Q2': [2,3,1,2,3],
                 'Q3': [1,5,2,4,4]})
data

   Q1  Q2  Q3
0   1   2   1
1   3   3   5
2   4   1   2
3   3   2   4
4   4   3   4

In [12]:
result = data.apply(pd.value_counts).fillna(0); result

    Q1   Q2   Q3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

## Treating Missing Values

In [13]:
string_data = Series(['fa','feaf',np.nan,'fefa']); string_data

0      fa
1    feaf
2     NaN
3    fefa
dtype: object

In [14]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [15]:
string_data[0]= None; string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

#### method to handle missing values

function | description
------|-------
dropna | can add threshold
fillna | impute value
isnull |
notnull |

### drop missing values

In [16]:
from numpy import nan as NA

In [17]:
data = Series([1,NA,3.5,NA,7]); data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [18]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [20]:
data = DataFrame([[1.,6.5,3.],[1.,NA,NA],
                 [NA,NA,NA],[NA,6.5,3.]])
cleaned = data.dropna(); cleaned

     0    1    2
0  1.0  6.5  3.0

In [21]:
data.dropna(how = 'all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [22]:
data[4] = NA; data.dropna(axis =1, how = 'all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [25]:
df = DataFrame(np.random.randn(7,3))
df.ix[:4,1] = NA; df.ix[:2,2] = NA; df

          0         1         2
0  1.415899       NaN       NaN
1  0.795839       NaN       NaN
2  0.512657       NaN       NaN
3 -0.687305       NaN -0.613658
4 -1.908456       NaN  1.479917
5 -0.614800  1.778520  1.070246
6  2.044072  0.704742 -0.206530

In [26]:
df.dropna(thresh = 2)

          0         1         2
3 -0.687305       NaN -0.613658
4 -1.908456       NaN  1.479917
5 -0.614800  1.778520  1.070246
6  2.044072  0.704742 -0.206530

### Impute missing values

In [27]:
df.fillna(0)

          0         1         2
0  1.415899  0.000000  0.000000
1  0.795839  0.000000  0.000000
2  0.512657  0.000000  0.000000
3 -0.687305  0.000000 -0.613658
4 -1.908456  0.000000  1.479917
5 -0.614800  1.778520  1.070246
6  2.044072  0.704742 -0.206530

In [29]:
df.fillna({1:0.5,3:-1})

          0         1         2
0  1.415899  0.500000       NaN
1  0.795839  0.500000       NaN
2  0.512657  0.500000       NaN
3 -0.687305  0.500000 -0.613658
4 -1.908456  0.500000  1.479917
5 -0.614800  1.778520  1.070246
6  2.044072  0.704742 -0.206530

* return new object

In [31]:
_=df.fillna(0, inplace=True); df

          0         1         2
0  1.415899  0.000000  0.000000
1  0.795839  0.000000  0.000000
2  0.512657  0.000000  0.000000
3 -0.687305  0.000000 -0.613658
4 -1.908456  0.000000  1.479917
5 -0.614800  1.778520  1.070246
6  2.044072  0.704742 -0.206530

In [33]:
df = DataFrame(np.random.randn(6,3))
df.ix[2:,1] = NA; df.ix[4:,2] = NA; df

          0         1         2
0  0.916216 -0.874229  0.408158
1 -1.237658  1.148822  1.196109
2 -0.486829       NaN  0.059798
3  1.145007       NaN -0.224887
4 -0.074808       NaN       NaN
5 -0.100802       NaN       NaN

In [34]:
df.fillna(method='ffill')

          0         1         2
0  0.916216 -0.874229  0.408158
1 -1.237658  1.148822  1.196109
2 -0.486829  1.148822  0.059798
3  1.145007  1.148822 -0.224887
4 -0.074808  1.148822 -0.224887
5 -0.100802  1.148822 -0.224887

In [35]:
df.fillna(method='ffill', limit = 2)

          0         1         2
0  0.916216 -0.874229  0.408158
1 -1.237658  1.148822  1.196109
2 -0.486829  1.148822  0.059798
3  1.145007  1.148822 -0.224887
4 -0.074808       NaN -0.224887
5 -0.100802       NaN -0.224887

In [36]:
df.fillna(df.mean())

          0         1         2
0  0.916216 -0.874229  0.408158
1 -1.237658  1.148822  1.196109
2 -0.486829  0.137297  0.059798
3  1.145007  0.137297 -0.224887
4 -0.074808  0.137297  0.359795
5 -0.100802  0.137297  0.359795

* parameters in fillna

parameter | description
-----------|------------
value | value or dictionary
method | default 'ffill'
axis | default 0
inplace | modify the object itself
limit | maximum

## Hierarchical Indexing

In [2]:
data = Series(np.random.randn(10),
             index = [list('aaabbbccdd'),
                     [1,2,3,1,2,3,1,2,2,3]])
data

a  1    1.516915
   2   -1.185612
   3   -0.812274
b  1   -0.810201
   2    0.597837
   3    0.420430
c  1    0.542632
   2    1.144594
d  2   -0.752700
   3    0.444485
dtype: float64

In [3]:
data.index

MultiIndex(levels=[[u'a', u'b', u'c', u'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 1, 2, 0, 1, 1, 2]])

In [10]:
data['b']

1   -0.810201
2    0.597837
3    0.420430
dtype: float64

In [11]:
data['b':'c']

b  1   -0.810201
   2    0.597837
   3    0.420430
c  1    0.542632
   2    1.144594
dtype: float64

In [13]:
data.ix[['b','d']]

b  1   -0.810201
   2    0.597837
   3    0.420430
d  2   -0.752700
   3    0.444485
dtype: float64

In [15]:
data[:,2]

a   -1.185612
b    0.597837
c    1.144594
d   -0.752700
dtype: float64

#### unstack() to DataFrame like spread() in R, stack() like gather() in R

In [16]:
data.unstack()

          1         2         3
a  1.516915 -1.185612 -0.812274
b -0.810201  0.597837  0.420430
c  0.542632  1.144594       NaN
d       NaN -0.752700  0.444485

In [17]:
data.unstack().stack()

a  1    1.516915
   2   -1.185612
   3   -0.812274
b  1   -0.810201
   2    0.597837
   3    0.420430
c  1    0.542632
   2    1.144594
d  2   -0.752700
   3    0.444485
dtype: float64

In [18]:
frame = DataFrame(np.arange(12).reshape((4,3)),
                 index = [list('aabb'),[1,2,1,2]],
                 columns = [['Ohio','Ohio','Colorado'],
                           ['Green', 'Red', 'Green']])
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [20]:
frame.index.names = ['key1','key2']
frame.columns.names = ['state','color']; frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [24]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

* Create a MultiIndex to reuse

In [28]:
MyIndex = pd.MultiIndex.from_arrays([['Ohio','Ohio','Colorado'],
                           ['Green', 'Red', 'Green']],
                      names = ['state', 'color'])

### hierarchical reordering

In [29]:
frame.swaplevel('key1','key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [32]:
frame.sortlevel(1)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [33]:
frame.swaplevel(0,1).sortlevel(1)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

### summary at levels

In [35]:
frame.sum(level = 'key2')

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [36]:
frame.sum(level='color',axis=1)

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

### use the columns of DataFrame

In [40]:
frame = DataFrame({'a': range(7), 'b': range(7,0,-1),
                  'c': ['one','one','one','two','two','two','two'],
                  'd': [0,1,2,0,1,2,3]})
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

#### set_index(drop=False/True) like gather() and reset_index() like spread() in R, but different

In [44]:
frame2 = frame.set_index(['c','d']); frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [45]:
frame.set_index(['c','d'], drop = False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [47]:
frame2.reset_index().sort_index(axis = 1)

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

## Others about pandas

### integer indexing

In [49]:
ser = Series(np.arange(3.)); ser[-1]

KeyError: -1

In [50]:
ser2 = Series(np.arange(3.),index = list('abc')) ; ser2[-1]

2.0

* see the difference between integer indexing and non-integer indexing

In [54]:
ser.ix[:1]

0    0.0
1    1.0
dtype: float64

* valid, independ on indexing type, depend on location: iget_value(),  irow(), icol()

In [2]:
ser3 = Series(range(3), index = [-5,1,3])
ser3.iget_value(2)

/home/creatrol/anaconda2/lib/python2.7/site-packages/ipykernel/__main__.py:2: FutureWarning: iget_value(i) is deprecated. Please use .iloc[i] or .iat[i]
  from ipykernel import kernelapp as app

2

In [5]:
frame = DataFrame(np.arange(6).reshape(3,2), index = [2,0,1])
frame.irow(1)

/home/creatrol/anaconda2/lib/python2.7/site-packages/ipykernel/__main__.py:2: FutureWarning: irow(i) is deprecated. Please use .iloc[i]
  from ipykernel import kernelapp as app

0    2
1    3
Name: 0, dtype: int64

### Panel Data

* consider it as a 3-dimensional DataFrame

In [6]:
import pandas.io.data as web

/home/creatrol/anaconda2/lib/python2.7/site-packages/pandas/io/data.py:35: FutureWarning:
The pandas.io.data module is moved to a separate package (pandas-datareader) and will be removed from pandas in a future version.
After installing the pandas-datareader package (https://github.com/pydata/pandas-datareader), you can change the import ``from pandas.io import data, wb`` to ``from pandas_datareader import data, wb``.
  FutureWarning)

In [7]:
pdata = pd.Panel(dict((stk, web.get_data_yahoo(stk, '1/1/2009', '6/1/2012'))
                     for stk in ['AAPL','GOOG','MSFT','DELL']))
pdata

<class 'pandas.core.panel.Panel'>
Dimensions: 4 (items) x 868 (major_axis) x 6 (minor_axis)
Items axis: AAPL to MSFT
Major_axis axis: 2009-01-02 00:00:00 to 2012-06-01 00:00:00
Minor_axis axis: Open to Adj Close

In [16]:
pdata = pdata.swapaxes('items', 'minor_axis'); pdata

<class 'pandas.core.panel.Panel'>
Dimensions: 6 (items) x 868 (major_axis) x 4 (minor_axis)
Items axis: Open to Adj Close
Major_axis axis: 2009-01-02 00:00:00 to 2012-06-01 00:00:00
Minor_axis axis: AAPL to MSFT

In [18]:
pdata['Adj Close'].head()

                 AAPL      DELL        GOOG       MSFT
Date
2009-01-02  11.869133  10.39902  160.499779  16.612779
2009-01-05  12.370056  10.26359  163.861421  16.768039
2009-01-06  12.166024  10.68922  166.863420  16.964157
2009-01-07  11.903138  10.78596  160.844427  15.942712
2009-01-08  12.124172  10.90204  162.432840  16.441177

In [19]:
pdata.ix[:, '6/1/2012', :]

            Open        High         Low       Close       Volume   Adj Close
AAPL  569.159996  572.650009  560.520012  560.989983  130246900.0   73.371509
DELL   12.150000   12.300000   12.045000   12.070000   19397600.0   11.675920
GOOG  571.790972  572.650996  568.350996  570.981000    6138700.0  285.205295
MSFT   28.760000   28.959999   28.440001   28.450001   56634300.0   25.262972

In [20]:
pdata.ix['Adj Close', '5/22/2012':, :]

                 AAPL      DELL        GOOG       MSFT
Date
2012-05-22  72.845742  14.58765  300.100412  26.426222
2012-05-23  74.623162  12.08221  304.426106  25.849037
2012-05-24  73.937831  12.04351  301.528978  25.813517
2012-05-25  73.541536  12.05319  295.470050  25.804637
2012-05-28        NaN  12.05319         NaN        NaN
2012-05-29  74.846812  12.24666  296.873645  26.248626
2012-05-30  75.749262  12.14992  293.821674  26.053272
2012-05-31  75.560928  11.92743  290.140354  25.920075
2012-06-01  73.371509  11.67592  285.205295  25.262972

In [22]:
stacked = pdata.ix[:, '5/30/2012':,:].to_frame(); stacked

                        Open        High         Low       Close       Volume  \
Date       minor
2012-05-30 AAPL   569.199997  579.989990  566.559990  579.169998  132357400.0
           DELL    12.590000   12.700000   12.460000   12.560000   19787800.0
           GOOG   588.161028  591.901014  583.530999  588.230992    3827600.0
           MSFT    29.350000   29.480000   29.120001   29.340000   41585500.0
2012-05-31 AAPL   580.740021  581.499985  571.460022  577.730019  122918600.0
           DELL    12.530000   12.540000   12.330000   12.330000   19955600.0
           GOOG   588.720982  590.001032  579.001013  580.860990    5958800.0
           MSFT    29.299999   29.420000   28.940001   29.190001   39134000.0
2012-06-01 AAPL   569.159996  572.650009  560.520012  560.989983  130246900.0
           DELL    12.150000   12.300000   12.045000   12.070000   19397600.0
           GOOG   571.790972  572.650996  568.350996  570.981000    6138700.0
           MSFT    28.760000   28.959999   28.440001   28.450001   56634300.0

                   Adj Close
Date       minor
2012-05-30 AAPL    75.749262
           DELL    12.149920
           GOOG   293.821674
           MSFT    26.053272
2012-05-31 AAPL    75.560928
           DELL    11.927430
           GOOG   290.140354
           MSFT    25.920075
2012-06-01 AAPL    73.371509
           DELL    11.675920
           GOOG   285.205295
           MSFT    25.262972

In [23]:
stacked.to_panel()

<class 'pandas.core.panel.Panel'>
Dimensions: 6 (items) x 3 (major_axis) x 4 (minor_axis)
Items axis: Open to Adj Close
Major_axis axis: 2012-05-30 00:00:00 to 2012-06-01 00:00:00
Minor_axis axis: AAPL to MSFT